//
//  Dish.swift
//  DynoOrder
//
//  Created by Alex on 10/20/16.
//  Copyright © 2016 Alex. All rights reserved.
//

import Foundation

class Dish {
    var name = ""
    var size = 0
    var type = 0
    var price = 0.0
    
    func setData (name:String, price:Double) {
        self.name = name
        self.price = price
    }
    
}

class DB {
    
     static let sharedInstance = DB()
    let dishName = ["蘿蔔爌肉","辣炒年糕","蒜香油菜","豆腐味噌湯 香菇肉燥","咖哩魚蛋","蒜香菠菜","頭菜排骨湯 蒸豆豉魚","麻婆豆腐","薑絲小白","黃金蛋花湯 筍干扣肉","塔香豆干","蒜香陸妹","香菇蘿蔔湯 香酥魚排","回 鍋 肉","毛豆豆薯","奶香西米露 沙茶羊肉","塔香雙腸","黑椒豆芽","蛤仔冬瓜湯 鶉蛋肉燥","三 色 菜","薑絲小白","豆皮排骨湯 麥克雞腿堡","糖醋黃瓜","炸 薯 條","白玉瘦肉粥 高昇排骨","蕃茄豆腐","紅K豆薯","紅 豆 珍 珠 茄汁魚丁","蔥爆黑輪","蒜香菠菜","養生菇菇湯 韓式肉片","螞蟻上樹","菊絲紅K","酸 辣 湯 日式炸豬排","咖哩洋芋","蒜香油菜","魚丸蘿蔔湯 滷瓜仔肉","刺瓜肉羹","蒜香陸妹","帶芽味噌湯 三杯火腿","燴金豆腐","咖哩白花","綠 豆 薏 仁 蒸豆豉魚","香腸高麗","滷蘿蔔丁","豆薯蛋花湯 梅子肉丁","香菇白菜","滷 冬 瓜","黑輪蘿蔔湯 麵輪肉丁","蒜炒雙菇","蒜香油菜","玉米排骨湯 香滷雞排","玉米炒蛋","蒜香菠菜","燒 仙 草 黑椒肉片","麻油米血","薑絲小白","蕃茄羅宋湯 樹子蒸魚","八寶肉醬","菊絲高麗","佛 跳 牆 肉燥油豆腐","白 菜 滷","滷蘿蔔丁","紅 豆 湯 圓 鹹 酥 雞","炒 多 絲","滷 冬 瓜","紫菜蛋花湯" ]
    
}


